2nd part of homework

7) Pivot a DataFrame based on column values:
Take a DataFrame with columns representing categories and values, and pivot it to reshape the data, with the category values as columns and corresponding values in the cells.

In [5]:
import pandas as pa
import numpy as np

In [83]:
fake_data = {'product':['rain poncho', 'umbrella']*6,
        'quality':['low','medium','high']*4,
        'units in stock':[10,25,20,30,5,7]*2,
        'price':np.arange(3, 15, 1)}

In [85]:
df_fake_data = pa.DataFrame(fake_data)
df_fake_data.head(12)

        product quality  units in stock  price
0   rain poncho     low              10      3
1      umbrella  medium              25      4
2   rain poncho    high              20      5
3      umbrella     low              30      6
4   rain poncho  medium               5      7
5      umbrella    high               7      8
6   rain poncho     low              10      9
7      umbrella  medium              25     10
8   rain poncho    high              20     11
9      umbrella     low              30     12
10  rain poncho  medium               5     13
11     umbrella    high               7     14

In [23]:
pivot_df1 = df_fake_data.pivot_table(index='product', columns='quality', values=['units in stock', 'price'])

In [24]:
pivot_df1

            price            units in stock
quality      high low medium           high low medium
product
rain poncho     8   6     10             20  10      5
umbrella       11   9      7              7  30     25

8) Aggregate and pivot data:
Given a DataFrame with multiple columns, apply aggregation functions (e.g., sum, average) to the values and pivot the data based on specific columns.

In [26]:
pivot_df_sum = df_fake_data.pivot_table(index='product', columns='quality',
                                        values=['units in stock', 'price'],aggfunc=['sum'])

In [27]:
pivot_df_sum

              sum
            price            units in stock
quality      high low medium           high low medium
product
rain poncho    16  12     20             40  20     10
umbrella       22  18     14             14  60     50

In [28]:
pivot_df_mean = df_fake_data.pivot_table(index='product', columns='quality',
                                        values=['units in stock', 'price'],aggfunc=['mean'])

In [29]:
pivot_df_mean

             mean
            price            units in stock
quality      high low medium           high low medium
product
rain poncho     8   6     10             20  10      5
umbrella       11   9      7              7  30     25

In [34]:
pivot1 = df_fake_data.pivot_table(index='product', columns='quality', values=['units in stock'],aggfunc=['sum'])
pivot2 = df_fake_data.pivot_table(index='product', columns='quality', values=['price'],aggfunc=['mean'])
merged_df=pivot2.merge(pivot1, on=['product']).pivot_table(index=['Name', 0])

In [35]:
merged_df

         mean                       sum
        price            units in stock
quality  high low medium           high low medium
0          11   9      7             14  60     50
Name        8   6     10             40  20     10

9) Pivot with multi-index columns:
Perform a pivot operation on a DataFrame with multi-index columns, reshaping the data based on specific levels of the column index.

In [108]:
index = pa.MultiIndex.from_tuples([('Lithuania', 2000), ('Lithuania', 2020),
         ('Latvia', 2000), ('Latvia', 2020),
         ('Estonia', 2000), ('Estonia', 2020)])

In [114]:
data = pa.Series([3.5, 2.8,
                2.4, 1.9,
                1.4, 1.33],index=index)

In [116]:
pa.DataFrame(data).set_axis(['population'], axis=1)

                population
Lithuania 2000        3.50
          2020        2.80
Latvia    2000        2.40
          2020        1.90
Estonia   2000        1.40
          2020        1.33

In [107]:
data.unstack()

           2000  2020
Estonia     1.4  1.33
Latvia      2.4  1.90
Lithuania   3.5  2.80

10) Take any data (your choice) and visualize the data using Ploty library. You can select any plot type,
but you need to comment (write a comment in code) why the selected type of plot represents the data best

In [2]:
el_data = pa.read_excel('nordpool_daily.xlsx')

In [3]:
data.head()

        Date      LT      LV      EE      FI     SE4
0 2023-07-02    4.97    4.97    4.97    3.77    3.28
1 2023-07-01   64.25   64.25   64.25   29.70   34.26
2 2023-06-30  114.89  114.89   98.11   74.92  105.31
3 2023-06-29  118.41  118.41  118.41  109.10  117.98
4 2023-06-28  112.84  112.84  112.83  108.86  109.46